Revit 2027 API
DefinitionFile.Groups Property
Return a map of shared parameter definition groups contained within the file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DefinitionGroups Groups { get; }
Public ReadOnly Property Groups As DefinitionGroups
	Get
public:
property DefinitionGroups^ Groups {
	DefinitionGroups^ get ();
}
member Groups : DefinitionGroups with get
Property Value
DefinitionGroups
Remarks
A particular group can be found by Name, using the Item property on the DefinitionGroups object. A new group can be created by using the Create method on the DefinitionGroups Object. The Create method takes the name of the new group, as a string, as its input parameter, returning a reference to a new definition group object as its result.
See Also
Reference
DefinitionFile Class
Autodesk.Revit.DB Namespace